# Домашнее задание №N - Итераторы

## Условие

Реализуйте обобщенный интерфейс итератора, используя указатели на функции.

В этой задаче вам не нужно будет самостоятельно писать `main`, ввод и вывод данных, в этот раз вы напишете маленькую библиотеку. В файлах `iterator.h` и `list.h` описан функционал, который необходимо реализовать:

`iterator.h`:
- Структура `Iterator`. Необходимые поля придумайте самостоятельно.
- `void forEach(Iterator it, void (*func)(int))` - функция, принимающая по значению итератор, а также функцию, которая должна быть исполнена на каждом элементе, который он вернёт. По завершении работы функция должна полностью деинициализировать переданный ей итератор.
- `Iterator map(Iterator it, int (*func)(int))` - функция, принимающая итератор и функцию, принимающую `int` и возвращающую `int`, возвращающая новый итератор, который применяет функцию `func` к каждому элементу, полученному из `it`. Вместе со своей деинициализацией он должен уничтожить и `it`.

`list.h`:
- Структура `List` для реализации однозвязного списка с элементами типа `int`.
- `List* newEmptyList()` - функция, создающая новый пустой связный список.
- `List* prepend(List* head, int item)` - функция, добавляющая элемент в голову списка. Возвращает новую голову списка.
- `void deinitList(List* head)` - функция, очищающая память, выделенную под список.
- `Iterator iterateList(List* head)` - функция, создающая итератор по связному списку.

Обратите внимание, что итераторы **не** должны создавать новых коллекций. Итератор должен начинать работу только когда оказывается передан `forEach`.

Тестовая система сама считает список, создаст его, используя описанный интерфейс, и исполнит последовательность действий, эквивалентную этим примерам на разных языках:

```python
# Python
l = readList()
for i in l:
  print(i)

mapped = map(lambda x: x + 42, l)
for i in mapped:
  print(i)
```

```scala
// Scala
val l = readList()
l foreach println
l map { _ + 42 } foreach println
```

## Пример

### Входные данные

```
5 4 3 2 1 0
```

### Выходные данные

```
1 2 3 4 5
43 44 45 46 47
```
